HarryZeng/STM32F0_LZ8CCD/Peripherals/src/project.c

///**
//  ********************************  STM32F0x1  *********************************
//  * @文件名     ： differentialDC.c
//  * @作者       ： HarryZeng
//  * @库版本     ： V1.5.0
//  * @文件版本   ： V1.0.0
//  * @日期       ： 2017年05月11日
//  * @摘要       ： 数据处理
//  ******************************************************************************/
///*----------------------------------------------------------------------------
//  更新日志:
//  2017-05-11 V1.0.0:初始版本
//  ----------------------------------------------------------------------------*/
///* 包含的头文件 --------------------------------------------------------------*/
/* Includes ------------------------------------------------------------------*/
#include "project.h"
#include "bsp_init.h"
#include "key.h"
#include "display.h"
#include "SelfStudy.h"
#include "menu.h"
#include "flash.h"
#include "stm32f0xx_dma.h"
#include "stm32f0xx_tim.h"
#include "stm32f0xx_dac.h"

/*DSP库宏定义：ARM_MATH_CM0*/

uint32_t DealyBaseTime = 8;
uint16_t DEL = 50;

int16_t HI = 1000;
int16_t LO = 500;
bool timeflag = 0;
uint8_t LastOUT1 = 1;
uint8_t RegisterA = 0;
uint8_t LastRegisterA = 0;
uint8_t RegisterB = 1;
uint8_t RegisterC = 0;
uint8_t OUT1 = 0;
uint8_t OUT2 = 0;
uint8_t OUT3 = 0;
int16_t OUT2_TimerCounter = 0;
uint16_t OUT2_Timer = 0;
int16_t OUT3_TimerCounter = 0;
uint16_t OUT3_Timer = 0;
uint32_t ADCRawValue = 0;
int32_t ADC_Display = 0;
int32_t DACOUT1 = 1000;
int32_t DACOUT2 = 1000;
uint32_t CPV = 0;

Button_STATUS KEY = ULOC;
//uint8_t ConfirmShortCircuit = 0;
//uint32_t ShortCircuitCounter = 0;
//uint32_t ShortCircuitLastTime = 0;
uint8_t KeyMappingFlag = 0;
uint8_t EventFlag = 0x00;
uint8_t ShortCircuit = 0;
//uint32_t ShortCircuitTimer = 0;
uint8_t displayModeONE_FLAG = 0;
uint8_t DisplayModeNo = 0;

void SetRegisterA(uint32_t GetADCValue);
void DisplayMODE(void);
void DisplayModeONE(void);
void DisplayModeTWO(void);
void DisplayModeTHIRD(void);
void DisplayModeFour(void);
void ShortCircuitProtection(void);
void SetOUT1Status(void);
void SetOUT2Status(void);
void SetOUT3Status(void);
void ButtonMapping(void);
void DEL_Set(void);
void DisplayModeONE_STD(void);
void DisplayModeONE_AREA(void);
void ResetParameter(void);
void Test_Delay(uint32_t ms);
uint32_t ADCDispalyProcess(uint32_t *ADC_RowValue, uint16_t Length);
uint8_t CheckDust(void);

extern int8_t PERCENTAGE;
extern int16_t ATT100;
extern uint16_t FSV;
extern int32_t SV;
extern uint8_t SelftStudyflag;
extern int8_t DSC;
/*----------------------------------宏定义-------------------------------------*/

uint8_t DustFlag = 0;

int32_t SA = 0;
int32_t SA_Sum = 0;
float Final_1 = 0;
float Final = 0;

int32_t SX[4];
int32_t SX_Final[32];
uint8_t SX_Flag;
uint8_t SX_Index = 0;

int32_t S_Final = 0; /*S-SET*/
uint8_t S_Final_FinishFlag = 0;

uint32_t S32 = 0;
uint8_t S32_Flag = 0;


uint32_t S_Selft = 0;

int16_t Threshold = 1000;

int16_t DX = 0;
int16_t DX_Index = 0;
int16_t Last_DX = 0;
int16_t Min_DX = 4095;
int16_t Max_DX = 0;
uint8_t DX_Flag = 1;

int32_t TX_Index = 0;
int32_t TX = 0;
int32_t TX_Temp[4]={4096,4096,4096,4096};
int32_t TX_Sum=0;

int32_t 	SET_VREF = 0;
int16_t 	FX = 0;
uint8_t 	FX_Flag = 1;

//uint32_t Display_Signal[256];
//uint32_t Display_Signal_Index = 0;
//uint32_t Display_Signal_Flag = 0;
//uint32_t DisplayADCValue_Sum = 0;
///*去除最大最小值后剩下的数据求平均*/
//uint32_t DeleteMaxAndMinGetAverage(uint32_t *ary, uint8_t Length, uint32_t *Max, uint32_t *Min)
//{
//	int j;
//	uint32_t Sum = 0;
//	*Max = ary[0];
//	*Min = ary[0];

//	for (j = 1; j < Length; j++)
//	{
//		if (*Max < ary[j])
//			*Max = ary[j];

//		if (*Min > ary[j])
//			*Min = ary[j];
//	}

//	for (j = 0; j < Length; j++)
//	{
//		Sum += ary[j];
//	}
//	//return (Sum-*Max-*Min)/(Length-2);
//	return (Sum) / (Length);
//}
/*求总和*/
void GetSum(uint32_t *SUM, uint32_t *arry, uint8_t arryLength)
{
	int j;
	for (j = 0; j < arryLength; j++)
	{
		*SUM += arry[j];
	}
}

/*求平均*/
void GetAverage(uint32_t *Average, uint32_t *arry, uint8_t arryLength)
{
	int j;
	uint32_t sum;
	for (j = 0; j < arryLength; j++)
	{
		sum += arry[j];
	}
	*Average = sum / j;
}

///*清零函数*/
//void ClearData(uint32_t *ary, uint8_t Length)
//{
//	int j;
//	for (j = 0; j < Length; j++)
//	{
//		*ary = 0x00;
//		ary++; /*指针移位*/
//	}
//}

///*记录CPV并设置OUT的输出*/
//void CPV_SET_OUT(void)
//{
//	//uint8_t OUT1_LED,OUT2_LED,OUT3_LED;
//	if (LastOUT1 == 0 && OUT1 == 1)
//	{
//		CPV++;
//		if (CPV >= SV) /*如果计数器达到预先设定的SV，清零，OUT2输出一个高电平*/
//		{
//			OUT2 = 1;
//			//CPV = 0;
//		}
//		if (CPV >= FSV) /*如果计数器达到预先设定的FSV，清零，OUT3输出一个高电平*/
//		{
//			OUT3 = 1;
//			CPV = 0;
//		}
//	}
//	LastOUT1 = OUT1;
//	//		/*显示OUT1和OUT2的状态*/
//	SMG_DisplayOUT_STATUS(OUT1, OUT2);
//}

//uint8_t PWMCounter = 0;
//uint32_t S1024 = 0;
//uint16_t S1024_Index = 0;
//uint32_t S1024_Sum = 0;

#define S1024_Or_S8192 1024
void JudgeDX(void)
{
//	/*判断灰层影响程度*/
//	if (displayModeONE_FLAG == 0)
//	{
//		if (RegisterA) //STD——Mode
//		{

//			//S1024_Sum = S1024_Sum + S_Final;
//			S1024_Sum = S1024_Sum + SX_Final[SX_Index];
//			S1024_Index++;
//			if (S1024_Index >= S1024_Or_S8192)
//			{
//				S1024_Index = 0;
//				S1024 = S1024_Sum / S1024_Or_S8192; //求得S1024

//				if (DSC)				//modifiy 20180105
//					DX = S_SET - S1024; //modifiy 20171230
//				else
//					DX = 0;

//				S1024_Sum = 0;
//			}
//			if (DX <= -2000) //有疑问，当最小是-1500时，没有比它更小的了
//				DX = -2000;
//			else if (DX >= 2000)
//				DX = 2000;
//			//
//			//			Last_DX = DX;
//			//
//			//			if(Last_DX<Min_DX) 	/*用于记录最小的DX值*/
//			//				Min_DX = DX;

//			//DustFlag = CheckDust(); /*灰层积聚严重，DUST*/
//		}
//	}
//	else if (displayModeONE_FLAG == 1) /*Area Mode*/
//	{
//		if (RegisterC)
//		{
//			//S1024_Sum = S1024_Sum + S_Final;
//			S1024_Sum = S1024_Sum + SX_Final[SX_Index];
//			S1024_Index++;
//			if (S1024_Index >= S1024_Or_S8192)
//			{
//				S1024_Index = 0;
//				S1024 = S1024_Sum / S1024_Or_S8192; //求得S1024
//				if (DSC)							//modifiy 20180105
//					DX = S_SET - S1024;				//modifiy 20171230
//				else
//					DX = 0;
//				S1024_Sum = 0;
//			}
//			if (DX <= -2000) //有疑问，当最小是-1500时，没有比它更小的了
//				DX = -2000;
//			else if (DX >= 2000)
//				DX = 2000;
//			//
//			//			Last_DX = DX;
//			//
//			//			if(Last_DX<Min_DX) 	/*用于记录最小的DX值*/
//			//				Min_DX = DX;
//			//
//			//				//DustFlag = CheckDust(); /*灰层积聚严重，DUST*/
//		}
//	}
}

///*冒泡排序*/
//void bubbleSort(int *arr, int n) 
//{
//	int i;
//	int j;
//	int temp;
//	for ( i= 0; i<n - 1; i++)
//			for (j = 0; j < n - i - 1; j++)
//			{
//					if (arr[j] > arr[j + 1]) 
//					{
//							temp = arr[j]; arr[j] = arr[j + 1]; arr[j + 1] = temp;
//					}
//			}
//}


void JudgeTX(void)
{
	if(RegisterA==0)
	{
		if(TX_Temp[0]>Final_1)
			TX_Temp[0] = Final_1;
		else if(TX_Temp[1]>Final_1)
			TX_Temp[1] = Final_1;
		else if(TX_Temp[2]>Final_1)
			TX_Temp[2] = Final_1;
		else if(TX_Temp[3]>Final_1)
			TX_Temp[3] = Final_1;

