HarryZeng/STM32F0_LZ8CCD/Peripherals/src/project.c
		TX_Sum = TX_Temp[0]+TX_Temp[1]+TX_Temp[2]+TX_Temp[3];
		//TX_Index = 0;
		TX = TX_Sum / 4;
		TX_Sum = 0;
	
	}
}

uint8_t sample_finish = 0;
extern int32_t CSV;

uint32_t DMA_Counter = 0;
uint8_t RegisterA_1_Counter = 0;
uint8_t RegisterA_0_Counter = 0;
uint8_t TempRegisterA = 0;
int16_t DMA_ADC_Counter = 0;
uint8_t CheckCounter = 0;
uint8_t StartFlag=0;
void DMA1_Channel1_IRQHandler(void)
{
	if (DMA_GetITStatus(DMA_IT_TC)) //判断DMA传输完成中断
	{
			SA = 4095 - adc_dma_tab[0];
			SA_Sum = SA_Sum+SA;
			DMA_ADC_Counter++;
			if (DMA_ADC_Counter >= 4)
			{
				DMA_ADC_Counter = 0;
				Final_1 = SA_Sum / 4;
				SA_Sum = 0;
				DMA_Counter++;
				if (StartFlag==1)  //用作延时200ms，50us*4次=200us，所以200ms = 200us*1000
				{
						if(displayModeONE_FLAG==1 || FX_Flag==0)	/**AREA模式下或者自学习情况下，FX=0，TX=0**/  //2018-7-12 去掉|| SelftStudyflag==1 
						{
							FX = 0;
							//TX = 0;
						}
						else/*STD模式下*/
						{					
							/******TX******/
							JudgeTX();
							/*******FX*******/
							FX = SET_VREF - TX;     /*求FX*/
							if(FX>=600) FX = 600;		/**FX范围**/
							else if(FX<=-600) FX = -600;
						}
						
						Final = Final_1 - FX ;  //最终信号值
						
						if(Final>=9999)
								Final = 9999;
						if(Final<=0)
								Final = 0;
						
						/***************DX*************/
						
						DX_Index++;
						if(Final>=Max_DX)
							Max_DX = Final;
						if(Final<=Min_DX)
							Min_DX = Final;
						if(DX_Index>6)
						{
							DX_Index = 0;
							DX = Max_DX - Min_DX;
							Max_DX = 0;    /*初始化变量*/
							Min_DX = 4095; /*初始化变量*/
						}
						
						/***********Register A**********/
						if(displayModeONE_FLAG==1)	/**AREA模式**/
						{
							if(Final>=LO+2+DX && Final<=HI-2-DX)
								RegisterA = 1;
							else if((Final>=0&&Final<=LO-20-LO/128-0.125*DX)||(Final>=HI+20+HI/128+0.125*DX && Final<=9999)) //2018-06-18
								RegisterA = 0;
						}
						else if(displayModeONE_FLAG==0)/**STD模式**/
						{
							if(Final>=Threshold+2+DX)  //2018-06-18  TH+2+DX
								RegisterA = 1;
							else if(Final<=Threshold-4-Threshold/128-0.125*DX) //2018-06-19 TH-4-TH/128-0.125*DX
								RegisterA = 0;
						}		

				sample_finish = 1;


				/*设置OUT1的状态*/
				SetOUT1Status();
					/*OUT2输出*/
				SetOUT2Status();
					
				/*显示OUT1和OUT2的状态*/
				SMG_DisplayOUT_STATUS(OUT1, OUT2);
			}
			else 
			{
				JudgeTX();//TX = Final_1;   /*200ms前，使用Final_1作为TX*/ 2018-7-11修改成JudgeTX();
				if(DMA_Counter >=1000)
				{
					StartFlag = 1;
					FX = SET_VREF;
				}
			}
		}
		DMA_ClearITPendingBit(DMA_IT_TC); //清楚DMA中断标志位
	}
}

/*PG120-ADC-DMA*/
//void DMA1_Channel1_IRQHandler(void)
//{
//	uint32_t 	SX_Max=0;
//	uint32_t 	SX_Min=0;

//	uint32_t 	TX_Max=0;
//	uint32_t 	TX_Min=0;

//	uint32_t 	Dispaly_Max=0;
//	uint32_t 	Dispaly_Min=0;
//
//	int32_t tempdata;
//
// 	/*判断DMA传输完成中断*/
//	if(DMA_GetITStatus(DMA1_IT_TC1) != RESET)
//	{
//		if(PWMCounter<100)
//			PWMCounter++;
//		S[0] = 4095-adc_dma_tab[0];
//		S[1] = 4095-adc_dma_tab[1];
//		S[2] = 4095-adc_dma_tab[2];
//		S[3] = 4095-adc_dma_tab[3];
//		GetSum(&SX[S_Index++],S,4);/*四个通道总和*/
//		S_Flag = 1;
//
//		if(S_Index>3)
//		{
//				S_Index = 0;
//				/*SX,FX*/
//				tempdata = DeleteMaxAndMinGetAverage(SX,4,&SX_Max,&SX_Min);
//				SX_Final[SX_Index] = tempdata - 3000;/*求得并去掉最大最小值，求剩下数据的平均值,需要求32组*/
//				/*数据限位*/
//				if(SX_Final[SX_Index]>=9999)
//					SX_Final[SX_Index] = 9999;
//				if(SX_Final[SX_Index]<=0)
//					SX_Final[SX_Index] = 0;
//
//				/*求得S最终信号*/
//				S_Final = SX_Final[SX_Index] + DX;	/*获得最终信号值 信号值加上DX，得到的数据作为最终信号值*/
//				if(S_Final>=9999)
//					S_Final=9999;
//				if(S_Final<=0)
//					S_Final=0;
//				S_Final_FinishFlag = 1;
//
//
//				if(PWMCounter>50)/*大于等于50个PWM脉冲，才开始计算RegisterA*/
//					SetRegisterA(S_Final);/*判断RegisterA的状态*/
//				if(PWMCounter>80)
//					SetOUT1Status();/*大于等于50个PWM脉冲，才开始设置OUT输出*/
//
//				FX = (SX_Max-SX_Min);  /*求得FX*/
//				ClearData(SX,4);/*清零*/
//
//				/*TX*/
//				GetSum(&TX_Signal[TX_Index++],&S_Final,1);/*六次总和,TX*///20180106
//				if(TX_Index>=6)
//				{
//					TX_Index = 0;
//					DeleteMaxAndMinGetAverage(TX_Signal,6,&TX_Max,&TX_Min);
//					TX = (TX_Max-TX_Min);/*求得TX*/
//					//TX = 0;
//					ClearData(TX_Signal,8);/*清零*/
//				}
//
//				/*显示数据计数*/
//				GetSum(&DisplayADCValue_Sum,&S_Final,1);
//				Display_Signal_Index++;
//				if(Display_Signal_Index>=256)
//				{
//					ADCRawValue = DisplayADCValue_Sum/256;
//					Display_Signal_Index = 0;
//					Display_Signal_Flag	=	1;
//					DisplayADCValue_Sum = 0;
//
//				}

//				/*根据CPV，设置OUT输出*/
//				CPV_SET_OUT();
//				/*判断灰层*/
//				if(DX_Flag==1)
//					JudgeDX();
//				/*累计32组数据*/
//				SX_Index++;
//				if(SX_Index>31)
//				{
//					SX_Index = 0;
//					SX_Flag = 1;
//					/*自学习*/
//					if(SelftStudyflag)
//					{
//						DX = 0;
//						S1024 = 0;
//						//GetAverage(&S_SET,SX_Final,32); /*自学习，求得S-SET*/
//						//Threshold = S_SET-80;   /*更新阀值*/
//						S_SET = S_Final;
//
//						if(displayModeONE_FLAG)//区域模式
//						{
//							if(DisplayModeNo==0)
//							{
//								HI = S_SET*(100-PERCENTAGE)/100;   /*更新阀值,=S-SET*(1-1%)=S-SET*0.99=S-SET*99/100*/;
//								WriteFlash(HI_FLASH_DATA_ADDRESS,HI);
//							}
//							else if(DisplayModeNo==1)
//							{
//								LO =S_SET*(100-PERCENTAGE)/100;   /*更新阀值,=S-SET*(1-1%)=S-SET*0.99=S-SET*99/100*/;
//								WriteFlash(LO_FLASH_DATA_ADDRESS,LO);
//							}
//						}
//						else    //标准模式
//						{
//							Threshold = S_SET*(100-PERCENTAGE)/100;   /*更新阀值,=S-SET*(1-1%)=S-SET*0.99=S-SET*99/100*/
//							WriteFlash(Threshold_FLASH_DATA_ADDRESS,Threshold);
//						}
//						SelftStudyflag = 0;
//
//						WriteFlash(S_SET_FLASH_DATA_ADDRESS,S_SET);
//					}
//				}
//				/*计算时间*/
//				RunCounter[RunIndex] = TIM_GetCounter(TIM4);
//				if(RunCounter[RunIndex] >=3200)
//					Runflag = 1;
//				RunIndex++;
//		}
//	}
//	/*清除DMA中断标志位*/
//	DMA_ClearITPendingBit(DMA1_IT_TC1);
//}

/*采样完成后，ADC数据处理*/
uint32_t ADCDispalyProcess(uint32_t *ADC_RowValue, uint16_t Length)
{
	uint32_t DisplayADCValue = 0;
	uint32_t SumADCValue = 0;
	uint16_t k;
	for (k = 0; k < Length; k++)
		SumADCValue += ADC_RowValue[k];

