HarryZeng/STM32F0_LZ8CCD/Peripherals/src/project.c
	DisplayADCValue = SumADCValue / (k);

	return DisplayADCValue;
}

/*计算OUT1*/
/********************
*
*判断出RegisterA状态
*
**********************/
uint8_t GetRegisterAState(uint32_t ADCValue)
{
	uint8_t A;

	if (ADCValue >= Threshold)
		A = 1;
	else if (ADCValue <= Threshold - 50)
		A = 0;
	return A;
}

/*	正常显示*/
/********************
*
*显示ADC的值处理
*
**********************/

void GetTotalADCValue(void)
{
	uint32_t Dispaly_Max = 0;
	uint32_t Dispaly_Min = 0;

	ADC_Display = Final;
}

//void Get_SA_Value(uint32_t *SAvalue)
//{
//	/*正常显示*/
//	//*SAvalue = SA_Final;
//}

//void Get_SB_Value(uint32_t *SBvalue)
//{
//	/*正常显示*/
//	//*SBvalue =SB_Final;
//}

//void Get_S1_Value(uint32_t *S1value)
//{
//	/*正常显示*/
//	//*S1value =S1_Final;
//}
//void Get_S2_Value(uint32_t *S2value)
//{
//	/*正常显示*/
//	//*S2value =S2_Final;
//}

//uint16_t Dac1_Get_Vol(void)
//{
//	return DAC_GetDataOutputValue(DAC_Channel_2);
//}

uint16_t RealDACOUT = 0;

void Main_Function(void)
{
	GetEEPROM();
	
	while (1)
	{
		if (0)
		{
			Dust_Display();
			GPIO_WriteBit(OUT1_GPIO_Port, OUT1_Pin, Bit_RESET); /*一直将OUT1拉低*/
		}
		else
		{

			//RealDACOUT = Dac1_Get_Vol();
			/*正常显示模式*/
			DisplayMODE();

			/*按键复用*/
			ButtonMapping();

			if (KEY == ULOC) /*判断按键是否上锁*/
			{
				/*SET自学习模式*/
				if ((DisplayModeNo == 0 && displayModeONE_FLAG == 0) || (DisplayModeNo <= 1 && displayModeONE_FLAG == 1))
					selfstudy();
				/*Mode菜单模式*/
				menu();
			}
		}
	}
}

/*********************************
灰层积聚严重，DUST
**********************************/
uint8_t CheckDust(void)
{
	//if(DX>(S32/2))
	if (DX >= 1501)
	{
		return 1;
	}
	else
		return 0;
}

/*******************************
*
*显示模式切换
*
*******************************/

void DisplayMODE(void)
{
	if (ModeButton.Status == Press && (DownButton.Status == Press || SetButton.Status == Press || UpButton.Status == Press))
	{
	}
	else
	{
		if (KEY == ULOC)
		{
			if (ModeButton.PressCounter == 0)
			{
				DisplayModeNo = 0;
			}
			else if (ModeButton.Effect == PressShort && ModeButton.PressCounter == 1 && DownButton.Status == Release && UpButton.Status == Release)
			{
				DisplayModeNo = 1;
			}
			else if (ModeButton.Effect == PressShort && ModeButton.PressCounter == 2 && DownButton.Status == Release && UpButton.Status == Release)
			{
				DisplayModeNo = 2;
			}
//			else if (ModeButton.Effect == PressShort && ModeButton.PressCounter == 3 && DownButton.Status == Release && UpButton.Status == Release)
//			{
//				DisplayModeNo = 3;
//			}
			//			else if(ModeButton.Effect == PressShort && ModeButton.PressCounter==4 &&DownButton.Status==Release&&UpButton.Status==Release)
			//			{
			//				DisplayModeNo = 4;
			//			}
			/********mode 按键 循环*******/
			if (ModeButton.Effect == PressShort && ModeButton.PressCounter == 2 && DownButton.Status == Release && displayModeONE_FLAG == 0) //if need to display Mode_Four,PressCounter=4
			{
				ModeButton.PressCounter = 0;
				DisplayModeNo = 0;
			}
			else if (ModeButton.Effect == PressShort && ModeButton.PressCounter == 3 && DownButton.Status == Release && displayModeONE_FLAG == 1) //if need to display Mode_Four,PressCounter=5
			{
				ModeButton.PressCounter = 0;
				DisplayModeNo = 0;
			}
		}
		else
		{
			while (ModeButton.Status == Press || SetButton.Status == Press || DownButton.Status == Press || UpButton.Status == Press)
			{
				if (ModeButton.Effect == PressLong && UpButton.Status == Release && DownButton.Effect == PressLong && DownButton.Status == Press)
				{
					if (KEY == ULOC)
						KEY = LOC;
					else
					{
						KEY = ULOC;
						KeyMappingFlag = 0;
					}
					ModeButton.PressCounter = 0;
					while (ModeButton.Effect == PressLong && UpButton.Status == Release && DownButton.Effect == PressLong && DownButton.Status == Press)
					{
						ButtonMappingDisplay(1);
					}
					WriteFlash(KEY_FLASH_DATA_ADDRESS, KEY);
					ModeButton.Effect = PressNOEffect;
					ModeButton.PressCounter = 0;
					DownButton.PressCounter = 0;
					DownButton.Effect = PressNOEffect;
				}
				else
					ButtonMappingDisplay(1);
			}
		}
		/*显示*/
		if ((DisplayModeNo == 0 && displayModeONE_FLAG == 0) || (DisplayModeNo <= 1 && displayModeONE_FLAG == 1))
		{
			DisplayModeONE();
		}
		else if ((DisplayModeNo == 1 && displayModeONE_FLAG == 0) || (DisplayModeNo == 2 && displayModeONE_FLAG == 1))
		{
			//DisplayModeTWO();
			DisplayModeTHIRD();
		}
		else if ((DisplayModeNo == 2 && displayModeONE_FLAG == 0) || (DisplayModeNo == 3 && displayModeONE_FLAG == 1))
		{
			//DisplayModeTHIRD();
			//DisplayModeFour();
		}
		else if ((DisplayModeNo == 3 && displayModeONE_FLAG == 0) || (DisplayModeNo == 4 && displayModeONE_FLAG == 1))
		{
			//DisplayModeFour();
		}
	}
}

/*******************************
*
*显示模式1
*
*******************************/
int8_t LastDSC;
void DisplayModeONE(void)
{
	if (displayModeONE_FLAG)
	{
		if (DSC)
		{
			LastDSC = DSC;
			DSC = 0; //区域模式下，DX一直为0
		}
		DisplayModeONE_AREA();
	}
	else
	{
		if (LastDSC)
		{
			LastDSC = 0;
			DSC = 1;
		}
		DisplayModeONE_STD();
	}
}

/*******************************
*
*显示模式1_DETECT_STD
*
*******************************/
uint32_t tempPress = 0;
void DisplayModeONE_STD(void)
{
	static uint8_t lastCounter;
	static int16_t LastThreshold;

	/*数码管显示*/
	SMG_DisplayModeONE(Threshold, ADC_Display);

	if (ModeButton.Status == Release && KeyMappingFlag == 0 && KEY == ULOC)
	{
		/*Up Button*/
		LastThreshold = Threshold;
		if (UpButton.PressCounter != lastCounter && UpButton.Effect == PressShort)
		{
			lastCounter = UpButton.PressCounter;
			UpButton.PressCounter = 0;
			Threshold = Threshold + 1;
		}
		else if (UpButton.Status == Press && (UpButton.Effect == PressLong))
		{ /*还按着按键，并且时间超过长按时间*/
			UpButton.PressCounter = 0;
			if (UpButton.PressTimer <= KEY_LEVEL_1)
			{
				if (UpButton.PressTimer % KEY_LEVEL_1_SET == 0 && tempPress == 1)
				{
					Threshold = Threshold + 1;
					tempPress = 0;
				}
			}
			else if (UpButton.PressTimer > KEY_LEVEL_1 && UpButton.PressTimer <= KEY_LEVEL_2)
			{
				if (UpButton.PressTimer % KEY_LEVEL_2_SET == 0 && tempPress == 1)
				{
					tempPress = 0;
					Threshold = Threshold + 2;
				}
			}
			else
			{
				if (UpButton.PressTimer % KEY_LEVEL_3_SET == 0 && tempPress == 1)
				{
					tempPress = 0;
					Threshold = Threshold + 5;
				}
			}
		}
		else
		{
			UpButton.Effect = PressShort;
		}
		/*Down Button*/
		if (DownButton.PressCounter != lastCounter && DownButton.Effect == PressShort)
		{
			DownButton.PressCounter = 0;
			Threshold = Threshold - 1;
		}
		else if (DownButton.Status == Press && (DownButton.Effect == PressLong))
		{
			DownButton.PressCounter = 0;
			if (DownButton.PressTimer < KEY_LEVEL_1)
			{
				if (DownButton.PressTimer % KEY_LEVEL_1_SET == 0 && tempPress == 1)
				{
					Threshold = Threshold - 1;
					tempPress = 0;
				}
			}
			else if (DownButton.PressTimer > KEY_LEVEL_1 && DownButton.PressTimer < KEY_LEVEL_2)
			{
				if (DownButton.PressTimer % KEY_LEVEL_2_SET == 0 && tempPress == 1)
				{
					Threshold = Threshold - 2;
					tempPress = 0;
				}
			}
			else
			{
				if (DownButton.PressTimer % KEY_LEVEL_3_SET == 0 && tempPress == 1)
				{
					tempPress = 0;
					Threshold = Threshold - 5;
				}
			}
		}
		else
		{
			DownButton.Effect = PressShort;
		}
		if (LastThreshold != Threshold && DownButton.Status == Release && UpButton.Status == Release)
		{
			WriteFlash(Threshold_FLASH_DATA_ADDRESS, Threshold);
		}
	}
	if (Threshold >= 9999)
		Threshold = 9999;
	else if (Threshold <= 0)
		Threshold = 0;
}

