HarryZeng/STM32F0_LZ8CCD/Peripherals/src/project.c
/*******************************
*
*显示模式3
*
*******************************/
void DisplayModeTHIRD(void)
{
	/*数码管显示*/
	SMG_DisplayModeTHIRD(CPV);
	/*以下为清楚按键计数，防止会影响到显示模式4*/
	DownButton.PressCounter = 0;
	UpButton.PressCounter = 0;
}

/*******************************
*
*显示模式4
*
*******************************/
void DisplayModeFour(void)
{
	DEL_Set();
}

/*******************************
*
*OUT1_DEL 应差值设置
*
*******************************/
void DEL_Set(void)
{
	static uint8_t lastCounter;
	uint16_t LastDEL;

	/*显示SHOT,闪烁*/
	SMG_DisplayMenuTwo_DEL_SET(DEL, 0);

	/*Up Button*/
	LastDEL = DEL;
	if (UpButton.PressCounter != lastCounter && UpButton.Effect == PressShort)
	{
		lastCounter = UpButton.PressCounter;
		UpButton.PressCounter = 0;
		DEL = DEL + 1;
	}
	else if (UpButton.Status == Press && (UpButton.Effect == PressLong))
	{ /*还按着按键，并且时间超过长按时间*/
		UpButton.PressCounter = 0;
		if (UpButton.PressTimer < KEY_LEVEL_1)
		{
			if (UpButton.PressTimer % KEY_LEVEL_1_SET == 0)
				DEL = DEL + 1;
		}
		else if (UpButton.PressTimer > KEY_LEVEL_1 && UpButton.PressTimer < KEY_LEVEL_2)
		{
			if (UpButton.PressTimer % KEY_LEVEL_2_SET == 0)
				DEL = DEL + 1;
		}
		else
		{
			if (UpButton.PressTimer % KEY_LEVEL_3_SET == 0)
				DEL = DEL + 1;
		}
	}
	else
	{
		UpButton.Effect = PressShort;
	}
	/*Down Button*/
	if (DownButton.PressCounter != lastCounter && DownButton.Effect == PressShort)
	{
		DownButton.PressCounter = 0;
		DEL = DEL - 1;
	}
	else if (DownButton.Status == Press && (DownButton.Effect == PressLong))
	{ /*还按着按键，并且时间超过长按时间*/
		DownButton.PressCounter = 0;
		if (DownButton.PressTimer < KEY_LEVEL_1)
		{
			if (DownButton.PressTimer % KEY_LEVEL_1_SET == 0)
				DEL = DEL - 1;
		}
		else if (DownButton.PressTimer > KEY_LEVEL_1 && DownButton.PressTimer < KEY_LEVEL_2)
		{
			if (DownButton.PressTimer % KEY_LEVEL_2_SET == 0)
				DEL = DEL - 1;
		}
		else
		{
			if (DownButton.PressTimer % KEY_LEVEL_3_SET == 0)
				DEL = DEL - 1;
		}
	}
	else
	{
		DownButton.Effect = PressShort;
	}
	if (LastDEL != DEL && DownButton.Status == Release && UpButton.Status == Release)
	{
		//WriteFlash(DEL_FLASH_DATA_ADDRESS,DEL);
	}
	if (DEL >= 500)
		DEL = 500;
	else if (DEL <= 4)
		DEL = 4;
	//	}
}

/*******************************
*
*Set RegisterA value
*
*******************************/
void SetRegisterA(uint32_t ADCTestValue)
{
	//	TX = 0; //debug
	//	DX = 0;
	if (displayModeONE_FLAG) /*AREA Mode*/
	{
		if (ADCTestValue >= LO + TX && ADCTestValue <= HI - TX - 80 - HI / 128)
			RegisterA = 1;
		else if (((ADCTestValue >= (HI + TX)) && (ADCTestValue <= 9999)) || (ADCTestValue <= (LO - TX - 80 - LO / 128))) //20180106
			RegisterA = 0;

		/*RegisterC*/
		if (ADCTestValue >= HI + TX)
			RegisterC = 1;
		else if (ADCTestValue <= HI - TX - HI / 128)
			RegisterC = 0;
	}
	else /*STD Mode*/
	{
		if (ADCTestValue >= Threshold + TX) //20171231
			RegisterA = 1;
		else if (ADCTestValue <= (Threshold - TX - 40 - Threshold / 256)) /*20171223*/ //2018-1-5 修改成-80,//20180106 改成-40 /256
			RegisterA = 0;
	}
}

/*******************************
*
*判断OUT1的输出状态
*
*******************************/
uint8_t SHOTflag = 0;
uint8_t CPV_Status=0;

void SetOUT1Status(void)
{
	if (ShortCircuit != 1) /*不是短路保护的情况下才判断OUT1的输出*/
	{
		/*同或运算*/
//		if (GPIO_ReadInputDataBit(BUTTON_SWITCH_GPIO_Port, BUTTON_SWITCH_Pin))
//			RegisterB = 0;
//		else
//			RegisterB = 1;

		OUT1 = !(RegisterB ^ RegisterA);
		if (OUT1_Mode.DelayMode == TOFF)
		{
			//GPIOA->ODR ^= GPIO_Pin_9;
			if (OUT1 == 0)
			{
				GPIO_WriteBit(OUT1_GPIO_Port, OUT1_Pin, Bit_RESET);
				OUT1_Mode.DelayCounter = 0;
			}
			else
			{
				GPIO_WriteBit(OUT1_GPIO_Port, OUT1_Pin, Bit_SET);
				OUT1_Mode.DelayCounter = 0;
				CPV_Status = 1;
			}
		}
		/*OFFD*/
		else if (OUT1_Mode.DelayMode == OFFD)
		{
			if (OUT1 == 0)
			{
				if (OUT1_Mode.DelayCounter > (OUT1_Mode.DelayValue * DealyBaseTime))
				{
					GPIO_WriteBit(OUT1_GPIO_Port, OUT1_Pin, Bit_RESET);
					CPV_Status = 1;
				}
			}
			else
			{
				GPIO_WriteBit(OUT1_GPIO_Port, OUT1_Pin, Bit_SET);
				OUT1_Mode.DelayCounter = 0;
			}			
		}
		/*ON_D*/
		else if (OUT1_Mode.DelayMode == ON_D)
		{
			if (OUT1 == 0)
			{
				GPIO_WriteBit(OUT1_GPIO_Port, OUT1_Pin, Bit_RESET);
				OUT1_Mode.DelayCounter = 0;
			}
			else
			{
				if (OUT1_Mode.DelayCounter > (OUT1_Mode.DelayValue * DealyBaseTime))
				{
					GPIO_WriteBit(OUT1_GPIO_Port, OUT1_Pin, Bit_SET);
					CPV_Status = 1;
				}
			}
		}
		/*SHOT*/
		else if (OUT1_Mode.DelayMode == SHOT)
		{
			if (OUT1 == 0 && SHOTflag ==0)
			{
				OUT1_Mode.DelayCounter = 0;
				GPIO_WriteBit(OUT1_GPIO_Port, OUT1_Pin, Bit_RESET);
			}
			else if(OUT1 ==1 || SHOTflag == 1)
			{
				if (OUT1_Mode.DelayCounter < (OUT1_Mode.DelayValue * DealyBaseTime))
				{
					GPIO_WriteBit(OUT1_GPIO_Port, OUT1_Pin, Bit_SET);
					SHOTflag = 1;
					
				}
				else
				{
					GPIO_WriteBit(OUT1_GPIO_Port, OUT1_Pin, Bit_RESET);
					SHOTflag = 0;
					CPV_Status = 1;
				}
			}
		}
		
		/*********************CPV**************************/
			if(LastOUT1 == 0 && OUT1 == 1 && CPV_Status == 1)
			{
				CPV++;
				CPV_Status = 0;
				if (CPV >= CSV) /*如果计数器达到预先设定的CSV，清零，OUT2输出一个高电平*/
				{
					OUT2 = 1;
					CPV = 0;
				}
			}		
			LastOUT1 = OUT1;
	}
}
/*******************************
*
*判断OUT2的输出状态
*
*******************************/
void SetOUT2Status(void)
{
	if (ShortCircuit != 1) /*不是短路保护的情况下才判断OUT2的输出*/
	{
		if (OUT2)
		{
			//GPIO_WriteBit(OUT2_GPIO_Port, OUT2_Pin, Bit_SET); /*拉高*/
		}
		if (OUT2_TimerCounter >= 80)
		{
			OUT2 = 0;
			OUT2_TimerCounter = 0;								/*获取当前时间*/
			//GPIO_WriteBit(OUT2_GPIO_Port, OUT2_Pin, Bit_RESET); /*80ms后拉低*/
		}
	}
}

/*******************************
*
*判断OUT3的输出状态
*
*******************************/
void SetOUT3Status(void)
{
	if (ShortCircuit != 1) /*不是短路保护的情况下才判断OUT2的输出*/
	{
		if (OUT3)
		{
			//GPIO_WriteBit(OUT3_GPIO_Port,OUT3_Pin,Bit_SET);/*拉高*/
		}
		if (OUT3_TimerCounter >= 160)
		{
			OUT3 = 0;
			OUT3_TimerCounter = 0; /*获取当前时间*/
								   //GPIO_WriteBit(OUT3_GPIO_Port,OUT3_Pin,Bit_RESET);/*80ms后拉低*/
		}
	}
}

