HarryZeng/STM32F0_LZ8CCD/Peripherals/src/project.c
/*******************************
*
*短路保护
*
*******************************/
void ShortCircuitProtection(void)
{
//	uint8_t SCState;

//	/*读取SC引脚的状态*/
//	if (ShortCircuit != 1)
//	{
//		//SCState = GPIO_ReadInputDataBit(SC_GPIO_Port ,SC_Pin);
//		if ((BitAction)SCState == Bit_RESET)
//		{
//			/*拉低FB_SC*/
//			ShortCircuit = 1;
//		}
//		else
//		{
//			ShortCircuit = 0;
//			ConfirmShortCircuit = 0;
//		}
//	}
//	if (ShortCircuit && ShortCircuitCounter >= 100)
//	{
//		ConfirmShortCircuit = 1;
//		GPIO_WriteBit(OUT1_GPIO_Port, OUT1_Pin, Bit_RESET);
//		//GPIO_WriteBit(OUT2_GPIO_Port, OUT2_Pin, Bit_RESET); /*马上拉低OUT*/
//		//GPIO_WriteBit(OUT3_GPIO_Port,OUT3_Pin,Bit_RESET);/*马上拉低OUT*/
//		ShortCircuitTimer = ShortCircuitLastTime;
//	}
}

/*******************************
*
*按键复用
*
*******************************/
void ButtonMapping(void)
{
	/*按键上锁*/
	if (ModeButton.Effect == PressLong && UpButton.Status == Release && DownButton.Effect == PressLong && DownButton.Status == Press)
	{
		if (KEY == ULOC)
			KEY = LOC;
		else
			KEY = ULOC;
		ModeButton.PressCounter = 0;
		while (ModeButton.Effect == PressLong && UpButton.Status == Release && DownButton.Effect == PressLong && DownButton.Status == Press)
		{
			ButtonMappingDisplay(1);
			KeyMappingFlag = 1;
		}
		WriteFlash(KEY_FLASH_DATA_ADDRESS, KEY);
		ModeButton.Effect = PressNOEffect;
		ModeButton.PressCounter = 0;
		DownButton.PressCounter = 0;
		DownButton.Effect = PressNOEffect;
	}
	/*软件初始化*/
	else if (ModeButton.Effect == PressLong && SetButton.Effect == PressLong && SetButton.Status == Press && UpButton.Status == Release && DownButton.Status == Release)
	{
		takeoffLED();
		while ((ReadButtonStatus(&ModeButton)) == Press && (ReadButtonStatus(&SetButton) == Press))
		{
			EraseFlash();
			while ((ReadButtonStatus(&ModeButton)) == Press && (ReadButtonStatus(&SetButton) == Press))
				ButtonMappingDisplay(2);
		}

		ResetParameter();

		ModeButton.PressCounter = 0;
		ModeButton.Effect = PressNOEffect;
		DownButton.PressCounter = 0;
		DownButton.Effect = PressNOEffect;
		UpButton.PressCounter = 0;
		UpButton.Effect = PressNOEffect;
		Test_Delay(1000);
	}
	/*计算器清零*/
	else if (ModeButton.Effect == PressLong && UpButton.Status == Press && UpButton.Effect == PressLong && DownButton.Status == Release)
	{
		CPV = 0;
		while (ModeButton.Effect == PressLong && UpButton.Status == Press && UpButton.Effect == PressLong && DownButton.Status == Release)
		{
			ButtonMappingDisplay(3);
		}
		ModeButton.Effect = PressNOEffect;
		ModeButton.PressTimer = 0;
		ModeButton.PressCounter = 0;
		UpButton.PressCounter = 0;
		UpButton.Effect = PressNOEffect;
		Test_Delay(1000);
	}
}

void Test_Delay(uint32_t ms)
{
	uint32_t i;

	/*　
		CPU主频168MHz时，在内部Flash运行, MDK工程不优化。用台式示波器观测波形。
		循环次数为5时，SCL频率 = 1.78MHz (读耗时: 92ms, 读写正常，但是用示波器探头碰上就读写失败。时序接近临界)
		循环次数为10时，SCL频率 = 1.1MHz (读耗时: 138ms, 读速度: 118724B/s)
		循环次数为30时，SCL频率 = 440KHz， SCL高电平时间1.0us，SCL低电平时间1.2us

		上拉电阻选择2.2K欧时，SCL上升沿时间约0.5us，如果选4.7K欧，则上升沿约1us

		实际应用选择400KHz左右的速率即可
	*/
	for (i = 0; i < ms * 100; i++)
		;
}
/*******************************
*
*获取EEPROM参数
*
*******************************/

//	uint32_t _test_send_buf[30];
//	uint32_t _test_recv_buf[30];
//	short _test_size = 30;

//	char statusW=2;
//	char statusR=2;

uint32_t ProgramRUNcounter = 0;

void GetEEPROM(void)
{

	//			//OUT1_Mode.DelayMode 	= *(__IO uint32_t*)(OUT1_Mode_FLASH_DATA_ADDRESS);
	//			OUT1_Mode.DelayValue 	= *(__IO uint32_t*)(OUT1_Value_FLASH_DATA_ADDRESS);
	//			CSV 									= *(__IO uint32_t*)(CSV_FLASH_DATA_ADDRESS);
	//			Threshold 						= *(__IO uint32_t*)(Threshold_FLASH_DATA_ADDRESS);
	//			DACOUT 								= *(__IO uint32_t*)(DACOUT_FLASH_DATA_ADDRESS);
	//			KEY 									= *(__IO uint32_t*)(KEY_FLASH_DATA_ADDRESS);
	//			RegisterB 						= *(__IO uint32_t*)(RegisterB_FLASH_DATA_ADDRESS);
	//			DEL 									= *(__IO uint32_t*)(DEL_FLASH_DATA_ADDRESS);
	//			HI 										= *(__IO uint32_t*)(HI_FLASH_DATA_ADDRESS);
	//			LO 										= *(__IO uint32_t*)(LO_FLASH_DATA_ADDRESS);
	//			displayModeONE_FLAG 	= *(__IO uint32_t*)(DETECT_FLASH_DATA_ADDRESS);

	OUT1_Mode.DelayMode = ReadFlash(OUT1_Mode_FLASH_DATA_ADDRESS);
	OUT1_Mode.DelayValue = ReadFlash(OUT1_Value_FLASH_DATA_ADDRESS);
	CSV = ReadFlash(CSV_FLASH_DATA_ADDRESS);
	Threshold = ReadFlash(Threshold_FLASH_DATA_ADDRESS);
	DACOUT1 = ReadFlash(DACOUT1_FLASH_DATA_ADDRESS);
	KEY = ReadFlash(KEY_FLASH_DATA_ADDRESS);
	RegisterB = ReadFlash(RegisterB_FLASH_DATA_ADDRESS);
	DEL = ReadFlash(DEL_FLASH_DATA_ADDRESS);
	SET_VREF = ReadFlash(SET_VREF_FLASH_DATA_ADDRESS);
	//SB_MaxValue = ReadFlash(SB_MAX_FLASH_DATA_ADDRESS);
	displayModeONE_FLAG = ReadFlash(DETECT_FLASH_DATA_ADDRESS);
	HI = ReadFlash(HI_FLASH_DATA_ADDRESS);
	LO = ReadFlash(LO_FLASH_DATA_ADDRESS);
	DSC = ReadFlash(DSC_FLASH_DATA_ADDRESS);

//	DAC_SetChannel1Data(DAC_Align_12b_R, (uint16_t)DACOUT1);
//	DAC_SoftwareTriggerCmd(DAC_Channel_1, ENABLE);
//	DAC_SetChannel2Data(DAC_Align_12b_R, (uint16_t)DACOUT2);
//	DAC_SoftwareTriggerCmd(DAC_Channel_2, ENABLE);
}

/*****************************
*
*初始化所有参数
*
****************************/
void ResetParameter(void)
{
	CSV = 10;
	Threshold = 1000;
	KEY = ULOC;
	OUT1_Mode.DelayMode = TOFF;
	OUT1_Mode.DelayValue = 10;
	ATT100 = 100;
	DEL = 4;
	RegisterB = 1;
	HI = 1000;
	LO = 500;
	displayModeONE_FLAG = 0;
	PERCENTAGE = 1;
	DSC = 1;
	
	TX = SET_VREF;
	TX_Sum=0;
	TX_Index = 0;
	FX = 0;
	
	WriteFlash(OUT1_Mode_FLASH_DATA_ADDRESS, OUT1_Mode.DelayMode);
	Test_Delay(50);
	WriteFlash(OUT1_Value_FLASH_DATA_ADDRESS, OUT1_Mode.DelayValue);
	Test_Delay(50);
	WriteFlash(CSV_FLASH_DATA_ADDRESS, CSV);
	Test_Delay(50);
	WriteFlash(Threshold_FLASH_DATA_ADDRESS, Threshold);
	Test_Delay(50);
	WriteFlash(DACOUT1_FLASH_DATA_ADDRESS, DACOUT1);
	Test_Delay(50);
	WriteFlash(KEY_FLASH_DATA_ADDRESS, KEY);
	Test_Delay(50);
	WriteFlash(RegisterB_FLASH_DATA_ADDRESS, RegisterB);
	Test_Delay(50);
	WriteFlash(DEL_FLASH_DATA_ADDRESS, DEL);
	Test_Delay(50);
	WriteFlash(SET_VREF_FLASH_DATA_ADDRESS, SET_VREF);
	Test_Delay(50);
//	WriteFlash(SB_MAX_FLASH_DATA_ADDRESS, SB_MaxValue);
	Test_Delay(50);
	WriteFlash(DETECT_FLASH_DATA_ADDRESS, displayModeONE_FLAG);
	Test_Delay(50);
	WriteFlash(HI_FLASH_DATA_ADDRESS, HI);
	Test_Delay(50);
	WriteFlash(LO_FLASH_DATA_ADDRESS, LO);
	Test_Delay(50);
	WriteFlash(DSC_FLASH_DATA_ADDRESS, DSC);

	ModeButton.Effect = PressNOEffect;
	ModeButton.PressTimer = 0;
	ModeButton.PressCounter = 0;
	SetButton.Effect = PressNOEffect;
	SetButton.PressCounter = 0;
}
